# Задание 6
# Создайте словарь, в котором ключом будет являться число от 1 до 23, а значением -
# буквы английского алфавита. Решите эту задачу с помощью генератора словаря
# Решение:

print({key: value for key, value in zip(
    range(1, 24), map(chr, range(65, 88)))})  # for uppercase

# Output:
# {1: 'A', 2: 'B', 3: 'C', 4: 'D', 5: 'E', 6: 'F', 7: 'G', 8: 'H', 9: 'I', 10: 'J', 11: 'K', 12: 'L',
#     13: 'M', 14: 'N', 15: 'O', 16: 'P', 17: 'Q', 18: 'R', 19: 'S', 20: 'T', 21: 'U', 22: 'V', 23: 'W'}


print({key: value for key, value in zip(
    range(1, 24), map(chr, range(97, 123)))})  # for lowercase

# Output:
# {1: 'a', 2: 'b', 3: 'c', 4: 'd', 5: 'e', 6: 'f', 7: 'g', 8: 'h', 9: 'i', 10: 'j', 11: 'k', 12: 'l', 13: 'm', 14: 'n', 15: 'o', 16: 'p',
#     17: 'q', 18: 'r', 19: 's', 20: 't', 21: 'u', 22: 'v', 23: 'w'}
